Revit 2024 API
VertexPositionColored.GetColor Method
 Gets the vertex's color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ColorWithTransparency GetColor()
Visual Basic
Public Function GetColor As ColorWithTransparency
Visual C++
public:
ColorWithTransparency^ GetColor()
Return Value
 The vertex's color.
See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace